performance/results/20260725T145140Z/pgbench-write_shiba.txt
pgbench (17.10 (Homebrew))
transaction type: /Users/zzhang/Documents/Shiba/benchmarks/insert-batch.sql
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 4
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 400/400
number of failed transactions: 0 (0.000%)
latency average = 0.355 ms
latency stddev = 0.222 ms
initial connection time = 2.934 ms
tps = 11058.277120 (without initial connection time)
statement latencies in milliseconds and failures:
         0.000           0  \set group_seed random(1, 10000)
         0.354           0  INSERT INTO bench_events (event_id, group_id, amount)